
Page({
 


  data: {
    aa: '请小主选择您想要的功效哦！！小的给您推产品呦！！',
    items: [
      { v: '美白', id: '美白：Olay光感小白瓶、欧缇丽臻美亮白精华液 ~~~ ' },
      { v: '抗皱', id: '抗皱：Olay超A瓶、ANU焕能修护肌底精华液~~~' },
      { v: '补水保湿', id: 'ANU复活草面霜、城野医生aqua collagen gel~~~' },
      { v: '抗熊猫眼', id: '去黑眼圈：菲洛嘉雕塑360眼霜、兰蔻精华肌底眼部凝霜~~~' },
      { v: '润唇', id: '润唇：凡士林润唇膏（炒鸡适合晚上厚涂一层做唇膜！）、曼秀雷敦润唇膏~~~' },
      { v: '身体乳', id: '身体乳：标婷维生素E乳液、凡士林烟酰胺美白身体乳 ~~~ ' },
      { v: '祛斑', id: '祛斑：Olay的PROX小白瓶、资生堂新透白美肌集光阻黑精华液 ~~~ ' }
    ]
  },
  checkboxChange: function (e) {
    this.setData({
      aa: e.detail.value

    })
  }
})